app/controllers/sessions_controller.rb

  def create
    auth_hash = request.env['omniauth.auth']

    flash[:notice] = "Login failed!"
    return redirect_to root_path unless auth_hash['uid']

    @user = User.find_by(uid: auth_hash[:uid], provider: 'github')
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT 1  [["uid", "16039535"], ["provider", "github"]]