app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
  def index
    @tasks = Task.where(user_id: session[:user_id])

INSERT INTO "tasks" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sdkjfsdf"], ["description", "lksdnk"], ["user_id", 1], ["created_at", "2016-10-23 19:57:28.604511"], ["updated_at", "2016-10-23 19:57:28.604511"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "title" = ?, "description" = ?, "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", nil], ["description", nil], ["completed_at", nil], ["updated_at", "2016-09-29 23:34:30.642569"], ["id", 8]]
---
  def update
    find_task
    @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 15]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_task
    if Task.find(params[:id]).user_id == session[:user_id]