app/controllers/tasks_controller.rb

  def button
    @task = Task.find(params[:id])

    @task.completed_at = Time.now

    @task.save
---
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2016-09-30 17:19:41.865834"], ["updated_at", "2016-09-30 17:19:41.866499"], ["id", 11]]