app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def find_user
    @user = User.find(params[:id].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]